apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <syscfg/syscfg.h>
#include <bsp/cmsis_nvic.h>
#include <hal/hal_spi.h>
#include <nrf.h>
#include <nrf_spim.h>
#include <nrf_spis.h>
#include <nrf_drv_spi.h>
#include <nrf_drv_spis.h>
#include <nrf_drv_common.h>
#include <app_util_platform.h>

#ifndef min
#define min(a, b) ((a)<(b)?(a):(b))
#endif

/* XXX:
 * 1) what about stats?
 * 2) Dealing with errors (OVERFLOW, OVERREAD)
 * 3) Dont think I need dummy_rx as I can set master RX maxcnt to zero.
 */

/* The maximum number of SPI interfaces we will allow */
#define NRF52_HAL_SPI_MAX (2)

/* Used to disable all interrupts */
#define NRF_SPI_IRQ_DISABLE_ALL 0xFFFFFFFF

/*
 *  Slave states
 *
 *  IDLE: Slave not ready to be used. If master attempts to access
 *        slave it will receive the default character
 *  ACQ_SEM: Slave is attempting to acquire semaphore.
 *  READY: Slave is ready for master to send it data
 *
 */
#define HAL_SPI_SLAVE_STATE_IDLE        (0)
#define HAL_SPI_SLAVE_STATE_ACQ_SEM     (1)
#define HAL_SPI_SLAVE_STATE_READY       (2)

struct nrf52_hal_spi {
    uint8_t spi_type;
    uint8_t spi_xfr_flag;   /* Master only */
    uint8_t dummy_rx;       /* Master only */
    uint8_t slave_state;    /* Slave only */
    uint16_t nhs_buflen;
    uint16_t nhs_bytes_txd;
    struct hal_spi_settings spi_cfg; /* Slave and master */
    union {
        nrf_drv_spi_t   spim;
        nrf_drv_spis_t  spis;
    } nhs_spi;

    /* Pointers to tx/rx buffers */
    uint8_t *nhs_txbuf;
    uint8_t *nhs_rxbuf;

    /* Callback and arguments */
    hal_spi_txrx_cb txrx_cb_func;
    void            *txrx_cb_arg;
};

#if MYNEWT_VAL(SPI_0_MASTER) || MYNEWT_VAL(SPI_0_SLAVE)
struct nrf52_hal_spi nrf52_hal_spi0;
#endif
#if MYNEWT_VAL(SPI_1_MASTER)  || MYNEWT_VAL(SPI_1_SLAVE)
struct nrf52_hal_spi nrf52_hal_spi1;
#endif

static const struct nrf52_hal_spi *nrf52_hal_spis[NRF52_HAL_SPI_MAX] = {
#if MYNEWT_VAL(SPI_0_MASTER) || MYNEWT_VAL(SPI_0_SLAVE)
    &nrf52_hal_spi0,
#else
    NULL,
#endif
#if MYNEWT_VAL(SPI_1_MASTER)  || MYNEWT_VAL(SPI_1_SLAVE)
    &nrf52_hal_spi1
#else
    NULL
#endif
};

#if MYNEWT_VAL(SPI_0_MASTER)
nrf_drv_spi_t inst_spi0_m = NRF_DRV_SPI_INSTANCE(0);
#endif
#if MYNEWT_VAL(SPI_1_MASTER)
nrf_drv_spi_t inst_spi1_m = NRF_DRV_SPI_INSTANCE(1);
#endif
#if MYNEWT_VAL(SPI_0_SLAVE)
nrf_drv_spis_t inst_spi0_s = NRF_DRV_SPIS_INSTANCE(0);
#endif
#if MYNEWT_VAL(SPI_1_SLAVE)
nrf_drv_spis_t inst_spi1_s = NRF_DRV_SPIS_INSTANCE(1);
#endif

#define NRF52_HAL_SPI_RESOLVE(__n, __v)                     \
    if ((__n) >= NRF52_HAL_SPI_MAX) {                       \
        rc = EINVAL;                                        \
        goto err;                                           \
    }                                                       \
    (__v) = (struct nrf52_hal_spi *) nrf52_hal_spis[(__n)]; \
    if ((__v) == NULL) {                                    \
        rc = EINVAL;                                        \
        goto err;                                           \
    }

#if (MYNEWT_VAL(SPI_0_MASTER) || MYNEWT_VAL(SPI_1_MASTER) )
static void
nrf52_irqm_handler(struct nrf52_hal_spi *spi)
{
    uint8_t xfr_bytes;
    uint16_t len;
    NRF_SPIM_Type *p_spim;

    p_spim = spi->nhs_spi.spim.p_registers;
    if (nrf_spim_event_check(p_spim, NRF_SPIM_EVENT_END)) {
        nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_END);

        /* Should not occur but if no transfer just leave  */
        if (spi->spi_xfr_flag == 0) {
            return;
        }

        /* Are there more bytes to send? */
        xfr_bytes = p_spim->TXD.AMOUNT;
        spi->nhs_bytes_txd += xfr_bytes;
        if (spi->nhs_bytes_txd < spi->nhs_buflen) {
            spi->nhs_txbuf += xfr_bytes;
            len = spi->nhs_buflen - spi->nhs_bytes_txd;
            len = min(255, len);
            nrf_spim_tx_buffer_set(p_spim, spi->nhs_txbuf, (uint8_t)len);

            /* If no rxbuf, we need to set rxbuf and maxcnt to 1 */
            if (spi->nhs_rxbuf) {
                spi->nhs_rxbuf += xfr_bytes;
                nrf_spim_rx_buffer_set(p_spim, spi->nhs_rxbuf, (uint8_t)len);
            }
            nrf_spim_task_trigger(p_spim, NRF_SPIM_TASK_START);
        } else {
            if (spi->txrx_cb_func) {
                spi->txrx_cb_func(spi->txrx_cb_arg, spi->nhs_buflen);

            }
            spi->spi_xfr_flag = 0;
            nrf_spim_int_disable(p_spim, NRF_SPIM_INT_END_MASK);
        }
    }
}
#endif

#if (MYNEWT_VAL(SPI_0_SLAVE)  || MYNEWT_VAL(SPI_1_SLAVE) )
static void
nrf52_irqs_handler(struct nrf52_hal_spi *spi)
{
    uint8_t xfr_len;
    NRF_SPIS_Type *p_spis;

    p_spis = spi->nhs_spi.spis.p_reg;

    /* Semaphore acquired event */
    if (nrf_spis_event_check(p_spis, NRF_SPIS_EVENT_ACQUIRED)) {
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_ACQUIRED);

        if (spi->slave_state == HAL_SPI_SLAVE_STATE_ACQ_SEM) {
            if (spi->nhs_txbuf == NULL) {
                nrf_spis_tx_buffer_set(p_spis, 0, 0);
            } else {
                nrf_spis_tx_buffer_set(p_spis, spi->nhs_txbuf, spi->nhs_buflen);
            }

            if (spi->nhs_rxbuf == NULL) {
                nrf_spis_rx_buffer_set(p_spis, 0, 0);
            } else {
                nrf_spis_rx_buffer_set(p_spis, spi->nhs_rxbuf, spi->nhs_buflen);
            }
            nrf_spis_task_trigger(p_spis, NRF_SPIS_TASK_RELEASE);
            spi->slave_state = HAL_SPI_SLAVE_STATE_READY;
        }
    }

    /* SPI transaction complete */
    if (nrf_spis_event_check(p_spis, NRF_SPIS_EVENT_END)) {
        nrf_spis_event_clear(p_spis, NRF_SPIS_EVENT_END);
        if (spi->slave_state == HAL_SPI_SLAVE_STATE_READY) {
            if (spi->txrx_cb_func) {
                /* Get transfer length */
                if (spi->nhs_txbuf == NULL) {
                    xfr_len = nrf_spis_rx_amount_get(p_spis);
                } else {
                    xfr_len = nrf_spis_tx_amount_get(p_spis);
                }
                spi->txrx_cb_func(spi->txrx_cb_arg, xfr_len);
            }
            spi->slave_state = HAL_SPI_SLAVE_STATE_IDLE;
        }
    }

