apache/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_spi.c
        /* If no rxbuf, we need to set rxbuf and maxcnt to 1 */
        spi->nhs_rxbuf = rxbuf;
        if (rxbuf == NULL) {
            nrf_spim_rx_buffer_set(p_spim, &spi->dummy_rx, 1);
        } else {
            nrf_spim_rx_buffer_set(p_spim, rxbuf, len);
        }

        nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_END);
        nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_STOPPED);

        nrf_spim_task_trigger(p_spim, NRF_SPIM_TASK_START);
        nrf_spim_int_enable(p_spim, NRF_SPIM_INT_END_MASK);
    } else {
        /* Must have txbuf or rxbuf */
        if ((txbuf == NULL) && (rxbuf == NULL)) {
            goto err;
        }

        /* XXX: what to do here? */
        if (len > 255) {
            goto err;
        }

        /*
         * Ready the slave for a transfer. Do not allow this to be called
         * if the slave has already been readied or is requesting the
         * semaphore
         */
        if (spi->slave_state != HAL_SPI_SLAVE_STATE_IDLE) {
            rc = -1;
            goto err;
        }

        spi->nhs_rxbuf = rxbuf;
        spi->nhs_txbuf = txbuf;
        spi->nhs_buflen = len;
        spi->slave_state = HAL_SPI_SLAVE_STATE_ACQ_SEM;
        nrf_spis_task_trigger(spi->nhs_spi.spis.p_reg, NRF_SPIS_TASK_ACQUIRE);
    }
    return 0;

err:
    return rc;
}

/**
 * Sets the default value transferred by the slave. Not valid for master
 *
 * @param spi_num SPI interface to use
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_slave_set_def_tx_val(int spi_num, uint16_t val)
{
    int rc;
    NRF_SPIS_Type *p_spis;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);
    if (spi->spi_type  == HAL_SPI_TYPE_SLAVE) {
        p_spis = spi->nhs_spi.spis.p_reg;
        nrf_spis_def_set(p_spis, (uint8_t) val);
        nrf_spis_orc_set(p_spis, (uint8_t) val);
        rc = 0;
    } else {
        rc = EINVAL;
    }

err:
    return rc;
}

/**
 * This aborts the current transfer but keeps the spi enabled.
 *
 * @param spi_num   SPI interface on which transfer should be aborted.
 *
 * @return int 0 on success, non-zero error code on failure.
 *
 * NOTE: does not return an error if no transfer was in progress.
 */
int
hal_spi_abort(int spi_num)
{
    int rc;
    NRF_SPIM_Type *p_spim;
    struct nrf52_hal_spi *spi;

    NRF52_HAL_SPI_RESOLVE(spi_num, spi);

    rc = 0;
    if (spi->spi_type  == HAL_SPI_TYPE_MASTER) {
        p_spim = spi->nhs_spi.spim.p_registers;
        if (spi->spi_xfr_flag) {
            nrf_spim_int_disable(p_spim, NRF_SPI_IRQ_DISABLE_ALL);
            hal_spi_stop_transfer(p_spim);
            spi->spi_xfr_flag = 0;
            nrf_spim_int_enable(p_spim, NRF_SPIM_INT_END_MASK);
        }
    } else {
        /* Only way I can see doing this is to disable, then re-enable */
        hal_spi_disable(spi_num);
        hal_spi_enable(spi_num);
    }

err:
    return rc;
}
